### Grouping & Aggregation of Data

In [ ]:
# df.groupby() - used to group rows of dataframe based on columns so that 
# we can apply some aggregation functions on it.
# df.sum()
# df.mean()
# df.count()
# df.max()
# df.min()
# df.std()

import pandas as pd
df = pd.read_csv("raw_data.csv")

In [23]:
# grouping is done on the basis of country & then we calculate mean of income.
df.groupby("country")["income"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [24]:
df.groupby("country")["gender"].count()

country
Canada    1
China     1
India     1
Mexico    1
Spain     1
USA       4
Name: gender, dtype: int64

In [25]:
df.groupby("country")["income"].min()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       47000.0
Name: income, dtype: float64

In [26]:
df.groupby("gender")["income"].mean()
# we read above line like this
# roup the data by gender, take the income column, and calculate the average income for each gender

gender
Female     65666.666667
Male       54800.000000
Unknown    47000.000000
Name: income, dtype: float64

In [ ]:
# df.agg() or df.aggregate() - used to apply one or more aggregation functions to specific column or multiple columns
df.groupby("country")["income"].agg(["mean","min","max"])

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

In [ ]:
# aggregation on single cols
df.groupby("country")["income"].aggregate (["mean", "min", "max"])

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

In [35]:
# rename aggregate on single columns
df.groupby("country")["income"].agg(avg_salary="mean",min_salary="min",max_salary="max")

         avg_salary  min_salary  max_salary
country
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India       73000.0     73000.0     73000.0
Mexico      45000.0     45000.0     45000.0
Spain           NaN         NaN         NaN
USA         55400.0     47000.0     62000.0

In [37]:
# aggregation on multiple cols 
df.groupby("gender").aggregate({
    "income":"max",
    "gender":"count"
    })

          income  gender
gender
Female   73000.0       4
Male     68000.0       5
Unknown  47000.0       1

In [38]:
# rename aggregate on multiple columns
df.groupby("gender").aggregate(
    highest_income=("income","max"),
    no_of_person=("gender","count")
)

         highest_income  no_of_person
gender
Female          73000.0             4
Male            68000.0             5
Unknown         47000.0             1